Revit 2027 API
SymbolTypeId.Newton Property
 Symbol N, indicating unit Newtons.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Newton { get; }
Public Shared ReadOnly Property Newton As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Newton {
	ForgeTypeId^ get ();
}
static member Newton : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace